<a href="https://colab.research.google.com/github/Sleeppyheadd/128-356-Big-Data-for-test/blob/main/DataSet.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

df =pd.read_csv('/content/drive/MyDrive/DataSet/titanic.csv')
print(df)

      pclass  survived                                             name  \
0        1.0       1.0                    Allen, Miss. Elisabeth Walton
1        1.0       1.0                   Allison, Master. Hudson Trevor
2        1.0       0.0                     Allison, Miss. Helen Loraine
3        1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4        1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1305     3.0       0.0                            Zabour, Miss. Thamine
1306     3.0       0.0                        Zakarian, Mr. Mapriededer
1307     3.0       0.0                              Zakarian, Mr. Ortin
1308     3.0       0.0                               Zimmerman, Mr. Leo
1309     NaN       NaN                                              NaN

         sex      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000    0.0    0.0   24160  211.3375       B5        S    2
1       male   0.9167    1.0    2.0  113781  151.5500  C22 C26        S   11
2     female   2.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
3       male  30.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
4     female  25.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1305  female      NaN    1.0    0.0    2665   14.4542      NaN        C  NaN
1306    male  26.5000    0.0    0.0    2656    7.2250      NaN        C  NaN
1307    male  27.0000    0.0    0.0    2670    7.2250      NaN        C  NaN
1308    male  29.0000    0.0    0.0  315082    7.8750      NaN        S  NaN
1309     NaN      NaN    NaN    NaN     NaN       NaN      NaN      NaN  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN
1309    NaN                              NaN

[1310 rows x 14 columns]

In [ ]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
#บอกมิติ หรือ 1310 แถว หรือ 14 คอลัม
print(df.shape)

(1310, 14)

In [ ]:
#print 10 แถวแรก
print(df.head(10))

   pclass  survived                                             name     sex  \
0     1.0       1.0                    Allen, Miss. Elisabeth Walton  female
1     1.0       1.0                   Allison, Master. Hudson Trevor    male
2     1.0       0.0                     Allison, Miss. Helen Loraine  female
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton    male
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
5     1.0       1.0                              Anderson, Mr. Harry    male
6     1.0       1.0                Andrews, Miss. Kornelia Theodosia  female
7     1.0       0.0                           Andrews, Mr. Thomas Jr    male
8     1.0       1.0    Appleton, Mrs. Edward Dale (Charlotte Lamson)  female
9     1.0       0.0                          Artagaveytia, Mr. Ramon    male

       age  sibsp  parch    ticket      fare    cabin embarked boat   body  \
0  29.0000    0.0    0.0     24160  211.3375       B5        S    2    NaN
1   0.9167    1.0    2.0    113781  151.5500  C22 C26        S   11    NaN
2   2.0000    1.0    2.0    113781  151.5500  C22 C26        S  NaN    NaN
3  30.0000    1.0    2.0    113781  151.5500  C22 C26        S  NaN  135.0
4  25.0000    1.0    2.0    113781  151.5500  C22 C26        S  NaN    NaN
5  48.0000    0.0    0.0     19952   26.5500      E12        S    3    NaN
6  63.0000    1.0    0.0     13502   77.9583       D7        S   10    NaN
7  39.0000    0.0    0.0    112050    0.0000      A36        S  NaN    NaN
8  53.0000    2.0    0.0     11769   51.4792     C101        S    D    NaN
9  71.0000    0.0    0.0  PC 17609   49.5042      NaN        C  NaN   22.0

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON
5                     New York, NY
6                       Hudson, NY
7                      Belfast, NI
8              Bayside, Queens, NY
9              Montevideo, Uruguay

In [ ]:
#ปริ้นจากล่างสุด
print(df.tail(10))

      pclass  survived                                     name     sex   age  \
1300     3.0       1.0  Yasbeck, Mrs. Antoni (Selini Alexander)  female  15.0
1301     3.0       0.0                     Youseff, Mr. Gerious    male  45.5
1302     3.0       0.0                        Yousif, Mr. Wazli    male   NaN
1303     3.0       0.0                    Yousseff, Mr. Gerious    male   NaN
1304     3.0       0.0                     Zabour, Miss. Hileni  female  14.5
1305     3.0       0.0                    Zabour, Miss. Thamine  female   NaN
1306     3.0       0.0                Zakarian, Mr. Mapriededer    male  26.5
1307     3.0       0.0                      Zakarian, Mr. Ortin    male  27.0
1308     3.0       0.0                       Zimmerman, Mr. Leo    male  29.0
1309     NaN       NaN                                      NaN     NaN   NaN

      sibsp  parch  ticket     fare cabin embarked boat   body home.dest
1300    1.0    0.0    2659  14.4542   NaN        C  NaN    NaN       NaN
1301    0.0    0.0    2628   7.2250   NaN        C  NaN  312.0       NaN
1302    0.0    0.0    2647   7.2250   NaN        C  NaN    NaN       NaN
1303    0.0    0.0    2627  14.4583   NaN        C  NaN    NaN       NaN
1304    1.0    0.0    2665  14.4542   NaN        C  NaN  328.0       NaN
1305    1.0    0.0    2665  14.4542   NaN        C  NaN    NaN       NaN
1306    0.0    0.0    2656   7.2250   NaN        C  NaN  304.0       NaN
1307    0.0    0.0    2670   7.2250   NaN        C  NaN    NaN       NaN
1308    0.0    0.0  315082   7.8750   NaN        S  NaN    NaN       NaN
1309    NaN    NaN     NaN      NaN   NaN      NaN  NaN    NaN       NaN

In [ ]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   float64
 1   survived   1309 non-null   float64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   float64
 6   parch      1309 non-null   float64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(7), object(7)
memory usage: 143.4+ KB
None

In [ ]:
#ดูค่าสถิติเบื้องต้น เลือกเรคคอร์ดที่ไม่มี non มาคำนวน
print(df.describe())

            pclass     survived          age        sibsp        parch  \
count  1309.000000  1309.000000  1046.000000  1309.000000  1309.000000
mean      2.294882     0.381971    29.881135     0.498854     0.385027
std       0.837836     0.486055    14.413500     1.041658     0.865560
min       1.000000     0.000000     0.166700     0.000000     0.000000
25%       2.000000     0.000000    21.000000     0.000000     0.000000
50%       3.000000     0.000000    28.000000     0.000000     0.000000
75%       3.000000     1.000000    39.000000     1.000000     0.000000
max       3.000000     1.000000    80.000000     8.000000     9.000000

              fare        body
count  1308.000000  121.000000
mean     33.295479  160.809917
std      51.758668   97.696922
min       0.000000    1.000000
25%       7.895800   72.000000
50%      14.454200  155.000000
75%      31.275000  256.000000
max     512.329200  328.000000

In [ ]:
#เรียกดูค่าว่าง true คือค่าว่าง
print(df.isnull())

      pclass  survived   name    sex    age  sibsp  parch  ticket   fare  \
0      False     False  False  False  False  False  False   False  False
1      False     False  False  False  False  False  False   False  False
2      False     False  False  False  False  False  False   False  False
3      False     False  False  False  False  False  False   False  False
4      False     False  False  False  False  False  False   False  False
...      ...       ...    ...    ...    ...    ...    ...     ...    ...
1305   False     False  False  False   True  False  False   False  False
1306   False     False  False  False  False  False  False   False  False
1307   False     False  False  False  False  False  False   False  False
1308   False     False  False  False  False  False  False   False  False
1309    True      True   True   True   True   True   True    True   True

      cabin  embarked   boat   body  home.dest
0     False     False  False   True      False
1     False     False  False   True      False
2     False     False   True   True      False
3     False     False   True  False      False
4     False     False   True   True      False
...     ...       ...    ...    ...        ...
1305   True     False   True   True       True
1306   True     False   True  False       True
1307   True     False   True   True       True
1308   True     False   True   True       True
1309   True      True   True   True       True

[1310 rows x 14 columns]

In [ ]:
#จำนวนผู้โดยสารที่รอดชีวิตและไม่รอดชีวิต
df['survived'].value_counts()

survived
0.0    809
1.0    500
Name: count, dtype: int64

In [ ]:
#สัดส่วนผู้รอดชีวิตผู้ชายกับผู้หญฺิง
import numpy as np
print(df['sex'].value_counts())

print('% of male who survived',100*np.mean(df['survived'][df['sex']=='male']))
print('% of female who survived',100*np.mean(df['survived'][df['sex']=='female']))

sex
male      843
female    466
Name: count, dtype: int64
% of male who survived 19.098457888493474
% of female who survived 72.74678111587983

In [ ]:
print(df['pclass'].value_counts())

pclass
3.0    709
1.0    323
2.0    277
Name: count, dtype: int64

In [ ]:
#percent of pclass [1:firstclass,2:secondclass,3:thirdclass]
#who survived
print('% of pclass who survived',100*np.mean(df['survived'][df['pclass']==1]))
print('% of pclass who survived',100*np.mean(df['survived'][df['pclass']==2]))
print('% of pclass who survived',100*np.mean(df['survived'][df['pclass']==3]))

% of pclass who survived 61.91950464396285
% of pclass who survived 42.96028880866426
% of pclass who survived 25.52891396332863

In [ ]:
#ค่าเฉลี่ยผู้รอดชีวิต
print(100*df[['pclass','survived']].groupby(['pclass']).mean())

         survived
pclass
1.0     61.919505
2.0     42.960289
3.0     25.528914

In [ ]:
#copy Dataframe
df2=df.copy()
#numbers of missing row for each column
df2.isnull().sum()

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

In [ ]:
#replace mean for missing in age column
df2['age'].fillna(df2['age'].mean(),inplace=True)
df2.isnull().sum()

/tmp/ipython-input-567515753.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['age'].fillna(df2['age'].mean(),inplace=True)

pclass          1
survived        1
name            1
sex             1
age             0
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

In [ ]:
#drop missing in embark column
df2.dropna(subset=['embarked'],inplace=True)
df2.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        0
boat          823
body         1186
home.dest     563
dtype: int64

In [ ]:
print(df2["cabin"].value_counts())

cabin
C23 C25 C27        6
B57 B59 B63 B66    5
G6                 5
B96 B98            4
F33                4
                  ..
F E46              1
F E57              1
F E69              1
E10                1
F38                1
Name: count, Length: 185, dtype: int64

In [ ]:
#replace missing whit mode for cabin column
df2['cabin'].fillna(df2['cabin'].mode()[0],inplace=True)
df2.isnull().sum()

/tmp/ipython-input-2509968263.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df2['cabin'].fillna(df2['cabin'].mode()[0],inplace=True)

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            1
cabin           0
embarked        0
boat          823
body         1186
home.dest     563
dtype: int64

In [ ]:
df2.dropna(subset=['fare'],inplace=True)
df2.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age             0
sibsp           0
parch           0
ticket          0
fare            0
cabin           0
embarked        0
boat          822
body         1186
home.dest     562
dtype: int64

In [ ]:
df2.drop(['boat','body','home.dest'],axis=1,inplace=True)
df2.isnull().sum()

pclass      0
survived    0
name        0
sex         0
age         0
sibsp       0
parch       0
ticket      0
fare        0
cabin       0
embarked    0
dtype: int64